[
  {
    "id": "ntu",
    "degree": "Bachelor of Engineering - B.Eng, Computer Science",
    "institution": "Nanyang Technological University Singapore",
    "location": "Singapore",
    "period": "August 2021 - January 2025",
    "distinction": true,
    "focus": "Artificial Intelligence and Data Science, Minor in Mathematics",
    "description": "Graduated with Highest Distinction (First Class Honours) through NTU's Accelerated Bachelor Program. Completed the degree in 3.5 years with a structured focus on mastering core CS, AI, and DS principles, and applying them through advanced research and projects.",
    "achievements": [
      "Honours Degree with Highest Distinction (First Class Honours) | GPA: 4.59/5.00",
      "Double Specialization in Artificial Intelligence and Data Science, Minor in Mathematics",
      "Selected for URECA research program and URECA-FYP, focusing on advanced machine learning models",
      "Completed degree in 3.5 years by overloading semesters",
      "Developed leadership, teamwork, and communication skills through collaborative research"
    ],
    "color": "#38bdf8",
    "icon": "GraduationCap"
  },
  {
    "id": "softuni",
    "degree": "Python Web Developer Diploma",
    "institution": "Software University (SoftUni)",
    "location": "Sofia, Bulgaria (Remote)",
    "period": "October 2018 - May 2020",
    "distinction": true,
    "focus": "Full-Stack Web Development with Python and Django",
    "description": "Completed an intensive and project-oriented web development program focused on building real-world Python and Django web applications, including RESTful APIs, database management, and frontend integration.",
    "achievements": [
      "Built full-stack Django applications with PostgreSQL and REST APIs",
      "Excelled in backend logic, testing, and deployment",
      "Achieved top academic performance with 6.00/6.00 GPA",
      "Delivered production-ready apps with frontend integration and robust backend"
    ],
    "color": "#38bdf8",
    "icon": "Code"
  },
  {
    "id": "hs",
    "degree": "High School Diploma, Mathematics and Computer Science",
    "institution": "First Private Mathematical High School",
    "location": "Sofia, Bulgaria",
    "period": "September 2016 - May 2021",
    "distinction": true,
    "focus": "Mathematics, Informatics, and Programming",
    "description": "Specialized in mathematics and informatics under the Bulgarian curriculum. Participated in competitive programming and mathematics contests, and served in the student council, developing both technical and leadership skills.",
    "achievements": [
      "Graduated with 5.97/6.00 GPA",
      "Excelled in mathematics competitions and problem-solving",
      "Took advanced programming courses in web development and C++",
      "Active member of the student council, enhancing leadership and organization skills"
    ],
    "color": "#38bdf8",
    "icon": "School"
  }
]
